Public Member Functions | Friends | List of all members
ACAPI::MEP::v1::RoutingNodeUIManager Class Referencefinal
MEP Element Manager
The RoutingNodeUIManager contains UI-related services for a RoutingNode. More...
#include <MEPRoutingNodeUIManager.hpp>
 Inheritance diagram for ACAPI::MEP::v1::RoutingNodeUIManager:
 Public Member Functions
Result< RoutingNodeDefault >  | CreateRoutingNodeDefaultFromToolUIData (const TBUI::IAPIToolUIData &toolUIData)
Creates a RoutingNodeDefault from a toolUIData.
Result< void >  | ApplyRoutingNodeDefaultToToolUIData (TBUI::IAPIToolUIData &toolUIData, const RoutingNodeDefault &routingNodeDefault)
Changes the default elem in the given toolUIData.
 Public Member Functions inherited from ACAPI::v1::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Friends
Result< RoutingNodeUIManager >  | CreateRoutingNodeUIManager ()
Creates a RoutingNodeUIManager.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::v1::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::v1::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
The RoutingNodeUIManager contains UI-related services for a RoutingNode.
Since
Archicad 28
Member Function Documentation
◆ ApplyRoutingNodeDefaultToToolUIData()
 Result< void > ACAPI::MEP::v1::RoutingNodeUIManager::ApplyRoutingNodeDefaultToToolUIData  |  ( |  TBUI::IAPIToolUIData &  |  toolUIData,
|  const RoutingNodeDefault &  |  routingNodeDefault
)
Changes the default elem in the given toolUIData.
Parameters
toolUIData | The data in which the default elem will be changed
routingNodeDefault | The default to be set
Returns
Returns error if the RoutingNodeDefault is not the same type as the Default in IAPIToolUIData, or if they mismatch in their MEP Domain, otherwise nothing.
◆ CreateRoutingNodeDefaultFromToolUIData()
 Result< RoutingNodeDefault > ACAPI::MEP::v1::RoutingNodeUIManager::CreateRoutingNodeDefaultFromToolUIData  |  ( |  const TBUI::IAPIToolUIData &  |  toolUIData | )
Creates a RoutingNodeDefault from a toolUIData.
Parameters
toolUIData | The data which contains the temporary state of the RoutingNode in the scope of a Settings Dialog.
Returns
Returns error if the given Default from the IAPIToolUIData is not an RoutingNodeDefault, otherwise returns the RoutingNodeDefault created from it.
Friends And Related Symbol Documentation
◆ CreateRoutingNodeUIManager
 Result< RoutingNodeUIManager > CreateRoutingNodeUIManager  |  ( |   | )
friend
Creates a RoutingNodeUIManager.
Returns
If able, creates a new manager for RoutingNode, otherwise Error.